JWT and Bcrypt add && frontend and backend connected
